# St7GetEnvelopeAdditionalBeamSlices

Returns the option to automatically insert slices to capture maxima and other points of interest in beam force and
moment envelopes.

long St7GetEnvelopeAdditionalBeamSlices(long uID, bool* Additional)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Additional
True to add additional slices.